In [1]:
## Data Project 1 - MaryGrace Gozzi, jpk5nq

#Project Summary: I used the SQL 'sakila' database for this project.  
#I saved 2 tables (customers, rental) from sakila as json files
#and then used the 'rental' json to populate a mongo database, and the 'customers' json file on its own
#my new database in SQL was called 'sakiladata', and i pulled data from mongo, a json file, and 
#a SQL database (sakila-> I pulled the 'payment' table) to populate it
# i then joined the customer and payment dimension tables with the rental fact table
# finally, i authored SQL select statements to confirm functionality

In [1]:
#### Install the Necessary Libraries

!pip install pymysql
!pip install mysql-connector-python

In [3]:
## import statments

import os
import json
import numpy
import datetime
import pandas as pd
import pymysql
from sqlalchemy import text
import mysql.connector
import pymongo
from sqlalchemy import create_engine
import sqlalchemy

In [ ]:
##Source 1: MongoDB Data

In [ ]:
## setting up connection to mongo, assigning connection variables

In [4]:
mysql_uid = "root"
mysql_pwd = "Uva!1819"
mysql_host_name='localhost'

port='3360'

atlas_cluster_name = "cluster0.xuibg2h"
atlas_user_name = "ds2002"
atlas_password = "UVA1819"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

m_src_dbname = "sakila"
dst_dbname = "sakilaData"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://ds2002:UVA1819@cluster0.xuibg2h.mongodb.net

In [25]:
#### define functions for getting data from and setting data into databases

In [6]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [6]:
#### Populate MongoDB with source data

In [7]:
#moving data from a json to mongo (will eventually extract back at out)

client = pymongo.MongoClient(conn_str["atlas"])
db = client[m_src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"rental" : 'rental.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

In [6]:
# Source 2: SQL database

#setting up a connector to the new database, sakilaData
# was getting an error using the code from class, so used this article for help making the connection:
# https://www.geeksforgeeks.org/how-to-connect-python-with-sql-database/

conn = mysql.connector.connect(
    user=mysql_uid,
    password=mysql_pwd,
    host=mysql_host_name
)

db_name = 'sakilaData'

# create the database
cursor = conn.cursor()
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {db_name};")

#use the database
cursor.execute(f"USE {db_name};")

In [7]:
# get_dataframe fuction and set_dataframe function --> functions for working with SQL database 

def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe

def two_set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlquery1= f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"
        print (sqlquery1)
        connection.execute(text(sqlquery1))
        #sqlEngine.execute(text(sqlquery1))
        #sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [8]:
## CREATE DIMENSION TABLES

## extracting 'payment' data from sakila (SQL sourced data)

sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_dataframe(mysql_uid, mysql_pwd, mysql_host_name, 'sakila', text(sql_payment))
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [9]:
## perform transformation: drop 'last update' (unnecessary info)
drop_cols = ['last_update']
df_payment.drop(drop_cols, axis=1, inplace=True)

df_payment.head(2)

   payment_id  customer_id  staff_id  rental_id  amount        payment_date
0           1            1         1         76    2.99 2005-05-25 11:30:37
1           2            1         1        573    0.99 2005-05-28 10:35:23

In [10]:
##load the new dataframe into the new database, sakilaData
db_operation = "insert"

tables = [('dim_payment', df_payment, 'rental_id')]

In [11]:
for table_name, dataframe, primary_key in tables:
    two_set_dataframe(mysql_uid, mysql_pwd, mysql_host_name, dst_dbname, dataframe, 
                  table_name, primary_key, db_operation)

ALTER TABLE dim_payment ADD PRIMARY KEY (rental_id);

In [6]:
#creating fact table with mongodb sourced data

#1) Extract data into dataframes

In [10]:
query = {}
collection = "rental"

df_rental = get_mongo_dataframe(conn_str['atlas'], m_src_dbname, collection, query)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
1,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [8]:
#### Transformations
# renaming columns and dropping unnecessary info (anything but the ids)

In [18]:
#df_rental.rename(columns={"rental_date":"rental_date_out"}, inplace=True)

drop_cols2 = ['return_date', 'rental_date']
df_rental.drop(drop_cols2, axis=1, inplace=True)
df_rental.head(2)

   rental_id  inventory_id  customer_id  staff_id
0          2          1525          459         1
1          5          2079          222         1

In [10]:
#### put the dataframe into sakilaData

In [20]:
dataframe = df_rental
table_name2 = 'fact_rental'
primary_key2 = 'rental_id'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name2, primary_key2, db_operation)

In [23]:
### 3rd Source: json file
# loading the json data into a dataframe

df_customers = pd.read_json(r'C:\Users\DS2002\Downloads\customers.json')
df_customers.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [24]:
## putting the json-sourced dataframe into sakilaData

dataframe3= df_customers
table_name3='dim_customers'
primary_key3='customer_id'
db_operation='insert'


set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe3, table_name3, primary_key3, db_operation)